apps/api/benchmarks/artillery/copilot-load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 3
      name: "Warm up"
    - duration: 60
      arrivalRate: 10
      name: "Ramp up"
    - duration: 120
      arrivalRate: 20
      name: "Sustained load"
    - duration: 60
      arrivalRate: 10
      name: "Ramp down"
    - duration: 30
      arrivalRate: 3
      name: "Cool down"

scenarios:
  - name: "Copilot Load Test"
    flow:
      # Simple copilot query
      - post:
          url: '/copilot'
          json:
            message: 'What jobs match my profile?'
            context:
              candidateId: 'test-candidate'
          headers:
            Content-Type: 'application/json'
          expect:
            - statusCode: 200
      
      # Copilot with graph context
      - post:
          url: '/copilot'
          json:
            message: 'Analyze my knowledge graph'
            context:
              candidateId: 'test-candidate'
              includeGraph: true
          headers:
            Content-Type: 'application/json'
          expect:
            - statusCode: 200
      
      # Copilot streaming
      - post:
          url: '/copilot/stream'
          json:
            message: 'Help me improve my CV'
            context: {}
          headers:
            Content-Type: 'application/json'
          expect:
            - statusCode: 200
      
      - think: 2