apps/api/benchmarks/artillery/postgres-load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 10
      name: "Warm up"
    - duration: 60
      arrivalRate: 30
      name: "Ramp up"
    - duration: 120
      arrivalRate: 60
      name: "Sustained load"
    - duration: 60
      arrivalRate: 30
      name: "Ramp down"
    - duration: 30
      arrivalRate: 10
      name: "Cool down"

scenarios:
  - name: "Postgres Load Test"
    flow:
      # Create candidate
      - post:
          url: '/candidates'
          json:
            id: 'candidate-{{$randomNumber()}}'
            name: 'Test Candidate'
            email: 'test-{{$randomString()}}@example.com'
            skills:
              - JavaScript
              - React
              - Node.js
            experience: senior
          headers:
            Content-Type: 'application/json'
          capture:
            - json: '$.id'
              as: 'candidateId'
          expect:
            - statusCode: 201
      
      # Get candidate
      - get:
          url: '/candidates/{{ candidateId }}'
          expect:
            - statusCode: 200
      
      # Update candidate
      - patch:
          url: '/candidates/{{ candidateId }}'
          json:
            skills:
              - JavaScript
              - React
              - Node.js
              - TypeScript
          headers:
            Content-Type: 'application/json'
          expect:
            - statusCode: 200
      
      # List candidates
      - get:
          url: '/candidates?page=1&limit=20'
          expect:
            - statusCode: 200
      
      # Search candidates
      - get:
          url: '/candidates/search?skill=JavaScript'
          expect:
            - statusCode: 200
      
      # Delete candidate
      - delete:
          url: '/candidates/{{ candidateId }}'
          expect:
            - statusCode: 200
      
      - think: 0.5